import java.util.Scanner;

/*Напишите программу, которая бы определяла, 
 * является ли введённая буква (символ) гласной 
 * (постарайтесь сделать минимум четырьмя способами,
 *  разрешается и больше).*/
public class Exercise3_1 {

	public static void main(String[] args) {
		int n, heads = 0, i = 0;
		char simvol;
		char [] vowels= {'a','e','i','o','u','y','A','E','I','O','U','Y'};
		Scanner in = new Scanner(System.in);
		System.out.println("Введите гласную на латинице: ");
		simvol = in.next;

	}

}
